output/zeroflush_m3_perf/cmp_50gb_tr32/zf_read.txt
RocksDB:    version 11.2.0
Date:       Thu Sep  3 11:01:18 2026
CPU:        36 * Intel(R) Core(TM) i9-10980XE CPU @ 3.00GHz
CPUCache:   25344 KB
Set seed to 1788404474546167 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    50000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    49591.1 MB (estimated)
FileSize:   25177.0 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
WARNING: Optimization is disabled: benchmarks unnecessarily slow
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
DB path: [/tmp/zf_c50]
readrandom   :     211.773 micros/op 75347 ops/sec 212.350 seconds 16000000 operations;   47.2 MB/s (633070 of 1000000 found)

Microseconds per read:
Count: 16000000 Average: 211.7735  StdDev: 764.22
Min: 18  Median: 157.8576  Max: 597557
Percentiles: P50: 157.86 P75: 234.44 P99: 820.64 P99.9: 3381.20 P99.99: 9066.97
------------------------------------------------------
(      15,      22 ]        1   0.000%   0.000% 
(      22,      34 ]       47   0.000%   0.000% 
(      34,      51 ]     7812   0.049%   0.049% 
(      51,      76 ]   115022   0.719%   0.768% 
(      76,     110 ]  2086431  13.040%  13.808% ###
(     110,     170 ]  7259903  45.374%  59.183% #########
(     170,     250 ]  3142043  19.638%  78.820% ####
(     250,     380 ]  2317222  14.483%  93.303% ###
(     380,     580 ]   548528   3.428%  96.731% #
(     580,     870 ]   437454   2.734%  99.465% #
(     870,    1300 ]    44856   0.280%  99.746% 
(    1300,    1900 ]    11223   0.070%  99.816% 
(    1900,    2900 ]     9712   0.061%  99.877% 
(    2900,    4400 ]    11677   0.073%  99.950% 
(    4400,    6600 ]     4473   0.028%  99.978% 
(    6600,    9900 ]     2670   0.017%  99.994% 
(    9900,   14000 ]      327   0.002%  99.996% 
(   14000,   22000 ]      220   0.001%  99.998% 
(   22000,   33000 ]      104   0.001%  99.998% 
(   33000,   50000 ]       63   0.000%  99.999% 
(   50000,   75000 ]       55   0.000%  99.999% 
(   75000,  110000 ]       43   0.000%  99.999% 
(  110000,  170000 ]       60   0.000% 100.000% 
(  170000,  250000 ]       30   0.000% 100.000% 
(  250000,  380000 ]        8   0.000% 100.000% 
(  380000,  570000 ]       13   0.000% 100.000% 
(  570000,  860000 ]        3   0.000% 100.000% 

ZEROFLUSH PROPERTIES:
zf.epochs_sealed : 0
zf.epochs_materialized : 0
zf.epochs_reclaimed : 0
zf.live_wal_bytes : 221577960
zf.sealed_wal_bytes : 0
zf.materialize_micros : 0
zf.materialize_sort_micros : 0
zf.sealed_read_count : 0
zf.sealed_cache_miss : 0
zf.recovery_count : 0
zf.partition_skew : 1.9030
zf.install_direct_base : 0
zf.install_fallback_l0 : 0
zf.base_merge_count : 0
zf.base_merge_rewritten_bytes : 0
zf.skip_count : 0